## Lesson 2
2.1 Считывание данных

In [2]:
import pandas as pd
from datetime import datetime

In [3]:
df = pd.read_csv('D:/education/DA(Karpov)/DA_trial_stepik/lesson_1_data.csv', encoding='windows-1251', sep = ';')

In [4]:
df.head()

,Номер,Дата создания,Дата оплаты,Title,Статус,Заработано,Город,Платежная система
0,1062823,01.12.2019 10:50,01.12.2019 10:52,Курс обучения «Эксперт»,Завершен,29597.5,Чита,Сбербанк эквайринг
1,1062855,01.12.2019 20:53,01.12.2019 21:27,Курс обучения «Эксперт»,Завершен,17450.3,Краснодар,Яндекс.Касса
2,1062856,01.12.2019 21:43,NaN,Курс обучения «Специалист»,Отменен,0.0,NaN,NaN
3,1062880,03.12.2019 0:18,NaN,Курс обучения «Консультант»,Отменен,0.0,г.Москва и Московская область,NaN
4,1062899,03.12.2019 21:43,NaN,Курс обучения «Эксперт»,Отменен,0.0,г.Москва и Московская область,NaN

In [5]:
df.tail()

,Номер,Дата создания,Дата оплаты,Title,Статус,Заработано,Город,Платежная система
287,1064720,30.12.2019 9:42,30.12.2019 12:49,Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...,Завершен,2935.44,Самарская область,Яндекс.Касса
288,1064724,30.12.2019 11:32,NaN,Курс обучения «Консультант»,Отменен,0.00,NaN,NaN
289,1064775,31.12.2019 2:17,31.12.2019 2:22,Курс обучения «Консультант»,Завершен,7423.92,NaN,"Сбербанк эквайринг,Бонусный счет"
290,1064793,31.12.2019 16:40,01.01.2020 14:29,Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...,Завершен,2935.44,Республика Карелия,Яндекс.Касса
291,1064796,31.12.2019 17:29,31.12.2019 17:32,Курс от Школы Диетологов. Повышение квалификац...,Завершен,9898.56,Уфа,"Сбербанк эквайринг,Бонусный счет"

In [6]:
df.shape

(292, 8)

In [7]:
df.dtypes

Номер                  int64
Дата создания         object
Дата оплаты           object
Title                 object
Статус                object
Заработано           float64
Город                 object
Платежная система     object
dtype: object

In [8]:
df.describe()

              Номер    Заработано
count  2.920000e+02    292.000000
mean   1.063745e+06   3397.615034
std    4.438688e+02   5771.572829
min    1.062823e+06      0.000000
25%    1.063608e+06      0.000000
50%    1.063698e+06   2935.440000
75%    1.063807e+06   2935.440000
max    1.064796e+06  42750.000000

In [9]:
df.columns

Index(['Номер', 'Дата создания', 'Дата оплаты', 'Title', 'Статус',
       'Заработано', 'Город', 'Платежная система'],
      dtype='object')

In [10]:
df = df.rename(columns = {'Номер': 'number', 
                    'Дата создания': 'create_date', 
                    'Дата оплаты': 'payment_date', 
                    'Title': 'title', 
                    'Статус': 'status',
                    'Заработано': 'money', 
                    'Город': 'city', 
                    'Платежная система': 'payment_system'})

In [11]:
all_money = df['money'].sum()

In [12]:
all_money

992103.5900000001

In [13]:
df.head()

,number,create_date,payment_date,title,status,money,city,payment_system
0,1062823,01.12.2019 10:50,01.12.2019 10:52,Курс обучения «Эксперт»,Завершен,29597.5,Чита,Сбербанк эквайринг
1,1062855,01.12.2019 20:53,01.12.2019 21:27,Курс обучения «Эксперт»,Завершен,17450.3,Краснодар,Яндекс.Касса
2,1062856,01.12.2019 21:43,NaN,Курс обучения «Специалист»,Отменен,0.0,NaN,NaN
3,1062880,03.12.2019 0:18,NaN,Курс обучения «Консультант»,Отменен,0.0,г.Москва и Московская область,NaN
4,1062899,03.12.2019 21:43,NaN,Курс обучения «Эксперт»,Отменен,0.0,г.Москва и Московская область,NaN

In [14]:
df['title']

0                                Курс обучения «Эксперт»
1                                Курс обучения «Эксперт»
2                             Курс обучения «Специалист»
3                            Курс обучения «Консультант»
4                                Курс обучения «Эксперт»
                             ...
287    Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...
288                          Курс обучения «Консультант»
289                          Курс обучения «Консультант»
290    Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...
291    Курс от Школы Диетологов. Повышение квалификац...
Name: title, Length: 292, dtype: object

In [15]:
df[['title', 'status']].head()

                         title    status
0      Курс обучения «Эксперт»  Завершен
1      Курс обучения «Эксперт»  Завершен
2   Курс обучения «Специалист»   Отменен
3  Курс обучения «Консультант»   Отменен
4      Курс обучения «Эксперт»   Отменен

In [16]:
df.status.head()

0    Завершен
1    Завершен
2     Отменен
3     Отменен
4     Отменен
Name: status, dtype: object

In [17]:
df.payment_date

0      01.12.2019 10:52
1      01.12.2019 21:27
2                   NaN
3                   NaN
4                   NaN
             ...
287    30.12.2019 12:49
288                 NaN
289     31.12.2019 2:22
290    01.01.2020 14:29
291    31.12.2019 17:32
Name: payment_date, Length: 292, dtype: object

In [18]:
money_title = df \
    .query("status == 'Завершен'") \
    .groupby(['title'], as_index=False) \
    .aggregate({'money': 'sum', 'number': 'count'}) \
    .sort_values('money', ascending=False) \
    .rename(columns={'number': 'success_orders'})

In [19]:
df.title.unique()

array(['Курс обучения «Эксперт»', 'Курс обучения «Специалист»',
       'Курс обучения «Консультант»', 'Курс от Школы Диетологов. Бизнес',
       'Курс от Школы Диетологов. Повышение квалификации. ',
       'Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автосписанием'],
      dtype=object)

In [20]:
money_title.money.sum()

992103.59

In [21]:
today_day = datetime.today().strftime('%Y-%m-%d')
file_name = 'money_title_{}.csv'
file_name = file_name.format(today_day)

In [22]:
if int(money_title.money.sum()) == int(all_money):
    print('OK! File {} is written.'.format(file_name))
    money_title.to_csv(file_name, index=False)
else:
    print('ERROR !')

OK! File money_title_2023-11-13.csv is written.

### Lesson 3
e-commerce

In [25]:
df_3 = pd.read_csv('D:/education/DA(Karpov)/DA_trial_stepik/lesson_3_data__1_.csv', encoding='windows-1251')

In [26]:
df_3.head()

,Unnamed: 0,tk,pl,dia,hs,tc,cta,id_art,id_subsubfam,id_subfam,...,id_famn,id_seccion,id_subagr,id_agr,vta,uni,id_artn,art_sp,fam_sp,fam_en
0,1242,120071109002055793,1,2007/11/09,0.505729,110000761,11000076,21895,101070640100,1010706401,...,10107064,10107,101,1,0.68,1.0,21895,MARAVILLA 500 G Store_Brand,PASTA ALIMENTICIA SE,pasta
1,1243,120070601004053633,1,2007/06/01,0.588519,110000761,11000076,21816,101070640100,1010706401,...,10107064,10107,101,1,0.38,1.0,21816,FIDEO CABELLIN 500 G Store_Brand,PASTA ALIMENTICIA SE,pasta
2,1244,120070928004076410,1,2007/09/28,0.785498,28491841,2849184,562840,101070640100,1010706401,...,10107064,10107,101,1,1.55,2.0,562840,SPAGUETTI Nє 5 500 G Brand_1,PASTA ALIMENTICIA SE,pasta
3,1245,120070616003074261,1,2007/06/16,0.550961,95931501,9593150,28914,101070640100,1010706401,...,10107064,10107,101,1,1.03,2.0,28914,FIDEO FIDEUБ 500 Brand_7,PASTA ALIMENTICIA SE,pasta
4,1246,120070519001018477,1,2007/05/19,0.804954,93265591,9326559,159867,101070640100,1010706401,...,10107064,10107,101,1,1.09,1.0,159867,MACARRONES GRATINAR 5 Brand_2,PASTA ALIMENTICIA SE,pasta

#### Анализ лояльности

In [27]:
user_df = df_3[['tc', 'art_sp']]

In [29]:
user_df

               tc                              art_sp
0       110000761  MARAVILLA        500 G Store_Brand
1       110000761  FIDEO CABELLIN   500 G Store_Brand
2        28491841        SPAGUETTI Nє 5 500 G Brand_1
3        95931501       FIDEO FIDEUБ      500 Brand_7
4        93265591      MACARRONES  GRATINAR 5 Brand_2
...           ...                                 ...
48124    45518841      FIDEOS 0         500 G Brand_4
48125   110824211      PLUMAS 3         500 G Brand_4
48126  1408670389  MACARRONES       500 G Store_Brand
48127  1408670389  SPAGHETTI        500 G Store_Brand
48128    48582221  SPAGHETTINI      500 G Store_Brand

[48129 rows x 2 columns]

In [31]:
user_df.shape

(48129, 2)

In [62]:
user_df = user_df.rename(columns={'tc': 'user_id', 'art_sp': 'brand_info'})

In [61]:
user_df.head()

     user_id                          brand_info
0  110000761  MARAVILLA        500 G Store_Brand
1  110000761  FIDEO CABELLIN   500 G Store_Brand
2   28491841        SPAGUETTI Nє 5 500 G Brand_1
3   95931501       FIDEO FIDEUБ      500 Brand_7
4   93265591      MACARRONES  GRATINAR 5 Brand_2

In [70]:
user_df[['brand_info']]

                               brand_info
0      MARAVILLA        500 G Store_Brand
1      FIDEO CABELLIN   500 G Store_Brand
2            SPAGUETTI Nє 5 500 G Brand_1
3           FIDEO FIDEUБ      500 Brand_7
4          MACARRONES  GRATINAR 5 Brand_2
...                                   ...
48124      FIDEOS 0         500 G Brand_4
48125      PLUMAS 3         500 G Brand_4
48126  MACARRONES       500 G Store_Brand
48127  SPAGHETTI        500 G Store_Brand
48128  SPAGHETTINI      500 G Store_Brand

[48129 rows x 1 columns]

In [66]:
def split_brand(brand_name_data):
    return brand_name_data.split(' ')[-1]

In [67]:
brand_name = 'MARAVILLA 500 G Store_Brand'

In [68]:
brand_name.split(' ')

['MARAVILLA', '500', 'G', 'Store_Brand']

In [69]:
brand_name.split(' ')[-1]

# split_brand('MARAVILLA 500 G Store_Brand')

'Store_Brand'

In [72]:
user_df.brand_info.apply(split_brand)

0        Store_Brand
1        Store_Brand
2            Brand_1
3            Brand_7
4            Brand_2
            ...
48124        Brand_4
48125        Brand_4
48126    Store_Brand
48127    Store_Brand
48128    Store_Brand
Name: brand_info, Length: 48129, dtype: object

In [73]:
user_df['brand_name'] = user_df.brand_info.apply(split_brand)

In [74]:
user_df.head()

     user_id                          brand_info   brand_name
0  110000761  MARAVILLA        500 G Store_Brand  Store_Brand
1  110000761  FIDEO CABELLIN   500 G Store_Brand  Store_Brand
2   28491841        SPAGUETTI Nє 5 500 G Brand_1      Brand_1
3   95931501       FIDEO FIDEUБ      500 Brand_7      Brand_7
4   93265591      MACARRONES  GRATINAR 5 Brand_2      Brand_2

In [77]:
# lambda function. В данном случае делает одно пребразование с нашим аргументом. 
# Называем аргумент x, после : пишем, что хотим сделать с аргументом.
# Более короткий способ получить имя брэнда
user_df.brand_info.apply(lambda x: x.split(' ')[-1])

0        Store_Brand
1        Store_Brand
2            Brand_1
3            Brand_7
4            Brand_2
            ...
48124        Brand_4
48125        Brand_4
48126    Store_Brand
48127    Store_Brand
48128    Store_Brand
Name: brand_info, Length: 48129, dtype: object

In [ ]:
# lambda x: x.split(' ')[-1]
# равносильно
# def f(x):
#     return x.split(' ')[-1]

In [78]:
user_df.head()

     user_id                          brand_info   brand_name
0  110000761  MARAVILLA        500 G Store_Brand  Store_Brand
1  110000761  FIDEO CABELLIN   500 G Store_Brand  Store_Brand
2   28491841        SPAGUETTI Nє 5 500 G Brand_1      Brand_1
3   95931501       FIDEO FIDEUБ      500 Brand_7      Brand_7
4   93265591      MACARRONES  GRATINAR 5 Brand_2      Brand_2

In [93]:
users_purchases = user_df.groupby('user_id', as_index=False) \
                         .agg({'brand_name': 'count'}) \
                         .rename(columns={'brand_name': 'purchases'}) \
                         .query('purchases >= 5')

In [94]:
users_purchases.head()

    user_id  purchases
1      1031          6
2      4241          5
11    25971          7
14    40911         27
16    45181          5

In [95]:
users_purchases.shape

(3383, 2)

In [96]:
users_purchases.purchases.median()

7.0

In [97]:
users_purchases.describe()

            user_id    purchases
count  3.383000e+03  3383.000000
mean   6.421500e+07     9.320130
std    1.504830e+08     5.623993
min    1.031000e+03     5.000000
25%    8.871271e+06     6.000000
50%    2.842547e+07     7.000000
75%    8.542964e+07    11.000000
max    1.408810e+09    60.000000

In [98]:
users_purchases.head()

    user_id  purchases
1      1031          6
2      4241          5
11    25971          7
14    40911         27
16    45181          5

In [104]:
user_df.groupby(['user_id', 'brand_name'], as_index=False) \
       .agg({'brand_info': 'count'}) \
        .query('user_id == 1031')

   user_id   brand_name  brand_info
1     1031      Brand_3           1
2     1031  Store_Brand           5

In [107]:
user_df.groupby(['user_id', 'brand_name'], as_index=False) \
       .agg({'brand_info': 'count'}) \
       .sort_values(['user_id', 'brand_info'], ascending=[False, False])

          user_id   brand_name  brand_info
18187  1408849249  Store_Brand           1
18186  1408840919  Store_Brand           1
18185  1408832719      Brand_4           3
18184  1408825059      Brand_1           1
18183  1408817589  Store_Brand           2
...           ...          ...         ...
3            4241      Brand_4           3
4            4241  Store_Brand           2
2            1031  Store_Brand           5
1            1031      Brand_3           1
0     -1236394515      Brand_4           1

[18188 rows x 3 columns]

In [116]:
lovely_brand_purchases_df = user_df.groupby(['user_id', 'brand_name'], as_index=False) \
                                 .agg({'brand_info': 'count'}) \
                                 .sort_values(['user_id', 'brand_info'], ascending=[False, False]) \
                                 .groupby('user_id') \
                                 .head(1) \
                                 .rename(columns={'brand_name': 'lovely_brand', 'brand_info': 'lovely_brand_purchases'})

In [121]:
users_unique_brands = user_df.groupby('user_id', as_index=False) \
        .agg({'brand_name': pd.Series.nunique}) \
        .rename(columns={'brand_name': 'unique_brands'})

In [122]:
users_unique_brands.head()

      user_id  unique_brands
0 -1236394515              1
1        1031              2
2        4241              2
3       17311              1
4       17312              2

In [117]:
users_purchases.head(5)

    user_id  purchases
1      1031          6
2      4241          5
11    25971          7
14    40911         27
16    45181          5

In [118]:
lovely_brand_purchases_df.head()

          user_id lovely_brand  lovely_brand_purchases
18187  1408849249  Store_Brand                       1
18186  1408840919  Store_Brand                       1
18185  1408832719      Brand_4                       3
18184  1408825059      Brand_1                       1
18183  1408817589  Store_Brand                       2

In [123]:
x = pd.Series([1, 2, 3])

In [127]:
x # x.nunique(), x.max(), x.min() ...

0    1
1    2
2    3
dtype: int64

In [130]:
users_unique_brands.user_id.nunique()

11764

In [131]:
users_unique_brands['user_id'].nunique()

11764

In [135]:
d = pd.DataFrame({'x': [1, 2, 3], 'y': ['a', 'b', 'c']})

In [136]:
d

   x  y
0  1  a
1  2  b
2  3  c

In [137]:
d.x

0    1
1    2
2    3
Name: x, dtype: int64